/* Домовились! ❤️ Даю тобі 5 задач на for...of — від простих до складніших. Потренуємо цикли, if, масиви та об'єкти.

Поки що без готових розв'язків. Ти пишеш код, я перевіряю, пояснюю помилки — і рухаємося далі до static.
🟢 Завдання 1. Парні числа
Є масив:
const numbers = [3, 8, 12, 7, 15, 20, 9, 4];

За допомогою for...of виведи в консоль лише парні числа.

Очікуваний результат:
8
12
20
4

Підказка: використовуй оператор %, який повертає остачу від ділення.*/


const numbers = [3, 8, 12, 7, 15, 20, 9, 4]; 

function numCheck (numbers){
for (const num of numbers) 
    if (num % 2 === 0)
{console.log (num)}}

numCheck(numbers)

