// Завдання 2
// Створіть функцію яка приймає один параметр: num. Усередині функції виведіть значення num в консоль.
// Після цього, рекурсивно викличте функцію зі зменшеним значенням num (наприклад, num - 1).
// Фунція повинна викликатися, доки num не стане менше або рівне 0.
// Викличте вашу функцію з аргументом, наприклад, 5, щоб почати рекурсивний лічильник.

function createFunc(num) {

    if (num <= 0) {
        console.log('no way');
        return;
    }

    console.log(num);

    if (num > 1) {
        createFunc(num - 1);
    }
    
    else {
        console.log(0);
    }
}

createFunc(10);
